#Assignment-01
Name-Amit Kumar

Roll no. -137

#Feature Engineering Techniques with Python

In [2]:
import matplotlib.pyplot as plt
import pandas as pd

In [ ]:
dataset = pd.read_csv('Mall_Customers.csv')
print(dataset)
dataset.head()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [ ]:
     
print(dataset.isnull().sum())

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

Drop sample of missing value

In [ ]:
dataset = dataset.dropna()
dataset.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

Replace missing values with categorical features

In [ ]:
dataset = dataset.fillna(0)

In [ ]:
dataset.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

Mean value or most frequent value of the features

In [3]:
dataset = pd.read_csv('challenger.csv')
print(dataset)
dataset['temperature'].fillna((dataset['pressure'].mean()), inplace=True)

    o_ring_ct  distress_ct  temperature  pressure  launch_id
0           6            0           66        50          1
1           6            1           70        50          2
2           6            0           69        50          3
3           6            0           68        50          4
4           6            0           67        50          5
5           6            0           72        50          6
6           6            0           73       100          7
7           6            0           70       100          8
8           6            1           57       200          9
9           6            1           63       200         10
10          6            1           70       200         11
11          6            0           78       200         12
12          6            0           67       200         13
13          6            2           53       200         14
14          6            0           67       200         15
15          6            0           75       200         16
16          6            0           70       200         17
17          6            0           81       200         18
18          6            0           76       200         19
19          6            0           79       200         20
20          6            0           75       200         21
21          6            0           76       200         22
22          6            1           58       200         23

In [ ]:
dataset.head()

   o_ring_ct  distress_ct  temperature  pressure  launch_id
0          6            0           66        50          1
1          6            1           70        50          2
2          6            0           69        50          3
3          6            0           68        50          4
4          6            0           67        50          5

In [4]:
dataset = pd.read_csv('challenger.csv')
dataset.head()

   o_ring_ct  distress_ct  temperature  pressure  launch_id
0          6            0           66        50          1
1          6            1           70        50          2
2          6            0           69        50          3
3          6            0           68        50          4
4          6            0           67        50          5

In [5]:
#invalid values
dataset.loc[(dataset['distress_ct'] != '1') & (dataset['temperature'] != '69')]

    o_ring_ct  distress_ct  temperature  pressure  launch_id
0           6            0           66        50          1
1           6            1           70        50          2
2           6            0           69        50          3
3           6            0           68        50          4
4           6            0           67        50          5
5           6            0           72        50          6
6           6            0           73       100          7
7           6            0           70       100          8
8           6            1           57       200          9
9           6            1           63       200         10
10          6            1           70       200         11
11          6            0           78       200         12
12          6            0           67       200         13
13          6            2           53       200         14
14          6            0           67       200         15
15          6            0           75       200         16
16          6            0           70       200         17
17          6            0           81       200         18
18          6            0           76       200         19
19          6            0           79       200         20
20          6            0           75       200         21
21          6            0           76       200         22
22          6            1           58       200         23

In [6]:
dataset= dataset.drop([0])
dataset.reset_index()

    index  o_ring_ct  distress_ct  temperature  pressure  launch_id
0       1          6            1           70        50          2
1       2          6            0           69        50          3
2       3          6            0           68        50          4
3       4          6            0           67        50          5
4       5          6            0           72        50          6
5       6          6            0           73       100          7
6       7          6            0           70       100          8
7       8          6            1           57       200          9
8       9          6            1           63       200         10
9      10          6            1           70       200         11
10     11          6            0           78       200         12
11     12          6            0           67       200         13
12     13          6            2           53       200         14
13     14          6            0           67       200         15
14     15          6            0           75       200         16
15     16          6            0           70       200         17
16     17          6            0           81       200         18
17     18          6            0           76       200         19
18     19          6            0           79       200         20
19     20          6            0           75       200         21
20     21          6            0           76       200         22
21     22          6            1           58       200         23

In [ ]:
#Categorical Encoding
#Discrete values and represent some sort of category or class
#Direct support to categorical variables without further manipulation, but some ML Algorithms does not support
dataset.dtypes

o_ring_ct      int64
distress_ct    int64
temperature    int64
pressure       int64
launch_id      int64
dtype: object

In [11]:
dataset = pd.read_csv('penguins_size.csv')
dataset.head()

  species     island  culmen_length_mm  ...  flipper_length_mm  body_mass_g     sex
0  Adelie  Torgersen              39.1  ...              181.0       3750.0    MALE
1  Adelie  Torgersen              39.5  ...              186.0       3800.0  FEMALE
2  Adelie  Torgersen              40.3  ...              195.0       3250.0  FEMALE
3  Adelie  Torgersen               NaN  ...                NaN          NaN     NaN
4  Adelie  Torgersen              36.7  ...              193.0       3450.0  FEMALE

[5 rows x 7 columns]

In [ ]:
categorical_data = dataset.drop(['culmen_length_mm', 'culmen_depth_mm', 'flipper_length_mm', 'body_mass_g'], axis=1)
categorical_data.head()

  species     island     sex
0  Adelie  Torgersen    MALE
1  Adelie  Torgersen  FEMALE
2  Adelie  Torgersen  FEMALE
3  Adelie  Torgersen     NaN
4  Adelie  Torgersen  FEMALE

In [ ]:
#Categorical Encoding : Label Encoding
categorical_data["species_cat"] = categorical_data["species"].cat.codes
categorical_data["island_cat"] = categorical_data["island"].cat.codes
categorical_data["sex_cat"] = categorical_data["sex"].cat.codes
categorical_data.head()

  species     island     sex  species_cat  island_cat  sex_cat
0  Adelie  Torgersen    MALE            0           2        1
1  Adelie  Torgersen  FEMALE            0           2        0
2  Adelie  Torgersen  FEMALE            0           2        0
3  Adelie  Torgersen     NaN            0           2       -1
4  Adelie  Torgersen  FEMALE            0           2        0

In [ ]:
print(categorical_data)

    species     island     sex  species_cat  island_cat  sex_cat
0    Adelie  Torgersen    MALE            0           2        1
1    Adelie  Torgersen  FEMALE            0           2        0
2    Adelie  Torgersen  FEMALE            0           2        0
3    Adelie  Torgersen     NaN            0           2       -1
4    Adelie  Torgersen  FEMALE            0           2        0
..      ...        ...     ...          ...         ...      ...
339  Gentoo     Biscoe     NaN            2           0       -1
340  Gentoo     Biscoe  FEMALE            2           0        0
341  Gentoo     Biscoe    MALE            2           0        1
342  Gentoo     Biscoe  FEMALE            2           0        0
343  Gentoo     Biscoe    MALE            2           0        1

[343 rows x 6 columns]

In [ ]:
#Categorical Encoding: One-Hot Encoding, Most Popular
#Spreads the values in a feature to multiple flag features and assigns values 0 or 1 to them
encoded_spicies = pd.get_dummies(categorical_data['species'])

In [ ]:
categorical_data = categorical_data.join(encoded_spicies)

In [ ]:
print(categorical_data)

    species     island     sex  species_cat  ...  sex_cat  Adelie  Chinstrap  Gentoo
0    Adelie  Torgersen    MALE            0  ...        1       1          0       0
1    Adelie  Torgersen  FEMALE            0  ...        0       1          0       0
2    Adelie  Torgersen  FEMALE            0  ...        0       1          0       0
3    Adelie  Torgersen     NaN            0  ...       -1       1          0       0
4    Adelie  Torgersen  FEMALE            0  ...        0       1          0       0
..      ...        ...     ...          ...  ...      ...     ...        ...     ...
339  Gentoo     Biscoe     NaN            2  ...       -1       0          0       1
340  Gentoo     Biscoe  FEMALE            2  ...        0       0          0       1
341  Gentoo     Biscoe    MALE            2  ...        1       0          0       1
342  Gentoo     Biscoe  FEMALE            2  ...        0       0          0       1
343  Gentoo     Biscoe    MALE            2  ...        1       0          0       1

[343 rows x 9 columns]

In [ ]:
encoded_island = pd.get_dummies(categorical_data['island'])
encoded_sex = pd.get_dummies(categorical_data['sex'])

In [ ]:
categorical_data = categorical_data.join(encoded_island)
categorical_data = categorical_data.join(encoded_sex)

In [ ]:
print(categorical_data)

    species     island     sex  species_cat  ...  Dream  Torgersen  FEMALE  MALE
0    Adelie  Torgersen    MALE            0  ...      0          1       0     1
1    Adelie  Torgersen  FEMALE            0  ...      0          1       1     0
2    Adelie  Torgersen  FEMALE            0  ...      0          1       1     0
3    Adelie  Torgersen     NaN            0  ...      0          1       0     0
4    Adelie  Torgersen  FEMALE            0  ...      0          1       1     0
..      ...        ...     ...          ...  ...    ...        ...     ...   ...
339  Gentoo     Biscoe     NaN            2  ...      0          0       0     0
340  Gentoo     Biscoe  FEMALE            2  ...      0          0       1     0
341  Gentoo     Biscoe    MALE            2  ...      0          0       0     1
342  Gentoo     Biscoe  FEMALE            2  ...      0          0       1     0
343  Gentoo     Biscoe    MALE            2  ...      0          0       0     1

[343 rows x 14 columns]

In [ ]:
categorical_data.head()

  species     island     sex  species_cat  ...  Dream  Torgersen  FEMALE  MALE
0  Adelie  Torgersen    MALE            0  ...      0          1       0     1
1  Adelie  Torgersen  FEMALE            0  ...      0          1       1     0
2  Adelie  Torgersen  FEMALE            0  ...      0          1       1     0
3  Adelie  Torgersen     NaN            0  ...      0          1       0     0
4  Adelie  Torgersen  FEMALE            0  ...      0          1       1     0

[5 rows x 14 columns]

In [ ]:
#Categorical Encoding: Count Encoding
#Convert each categorical value to its frequency(the number of times it appears in the dataset).
dataset = pd.read_csv('penguins_size.csv')
print(dataset)

    species     island  ...  body_mass_g     sex
0    Adelie  Torgersen  ...       3750.0    MALE
1    Adelie  Torgersen  ...       3800.0  FEMALE
2    Adelie  Torgersen  ...       3250.0  FEMALE
3    Adelie  Torgersen  ...          NaN     NaN
4    Adelie  Torgersen  ...       3450.0  FEMALE
..      ...        ...  ...          ...     ...
339  Gentoo     Biscoe  ...          NaN     NaN
340  Gentoo     Biscoe  ...       4850.0  FEMALE
341  Gentoo     Biscoe  ...       5750.0    MALE
342  Gentoo     Biscoe  ...       5200.0  FEMALE
343  Gentoo     Biscoe  ...       5400.0    MALE

[344 rows x 7 columns]

In [ ]:
categorical_data = dataset.drop(['culmen_length_mm', 'culmen_depth_mm','flipper_length_mm', 'body_mass_g'], axis=1)

In [ ]:
species_count = categorical_data['species'].value_counts()
island_count = categorical_data['island'].value_counts()
sex_count = categorical_data['sex'].value_counts()

In [ ]:
categorical_data['species_count_enc'] = categorical_data['species'].map(species_count)
categorical_data['island_count_enc'] = categorical_data['island'].map(island_count)
categorical_data['sex_count_enc'] = categorical_data['sex'].map(sex_count)

categorical_data

    species     island  ... island_count_enc  sex_count_enc
0    Adelie  Torgersen  ...               52          168.0
1    Adelie  Torgersen  ...               52          165.0
2    Adelie  Torgersen  ...               52          165.0
3    Adelie  Torgersen  ...               52            NaN
4    Adelie  Torgersen  ...               52          165.0
..      ...        ...  ...              ...            ...
339  Gentoo     Biscoe  ...              168            NaN
340  Gentoo     Biscoe  ...              168          165.0
341  Gentoo     Biscoe  ...              168          168.0
342  Gentoo     Biscoe  ...              168          165.0
343  Gentoo     Biscoe  ...              168          168.0

[344 rows x 6 columns]